app/controllers/users_controller.rb

INSERT INTO "users" ("name", "email", "created_at", "updated_at", "password_digest") VALUES (?, ?, ?, ?, ?)
---
  def create
    @user = User.new user_params
    if @user.save

UPDATE "users" SET "name" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["name", "hạnh tuyền 123"], ["updated_at", "2018-07-12 08:01:55.224620"], ["id", 14]]
---
  def update
    if @user.update_attributes user_params

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 13], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 14], ["LIMIT", 1]]
---
  def find_user
    @user = User.find_by id: params[:id]
    flash[:danger] = t "error.find_user" unless @user